; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	image2 - mode
	thermograph0 - mode
	infrared3 - mode
	spectrograph4 - mode
	image1 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star14 - direction
	GroundStation7 - direction
	Star9 - direction
	Star8 - direction
	GroundStation13 - direction
	GroundStation6 - direction
	Star11 - direction
	Star5 - direction
	GroundStation10 - direction
	Star4 - direction
	GroundStation3 - direction
	Star12 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 GroundStation10)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation7)
	(supports instrument3 image1)
	(calibration_target instrument3 Star12)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star11)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation10)
	(supports instrument5 image2)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation13)
	(calibration_target instrument5 Star12)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star11)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 GroundStation10)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star5)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 GroundStation10)
	(supports instrument9 image1)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 GroundStation10)
	(supports instrument10 image2)
	(supports instrument10 thermograph0)
	(supports instrument10 spectrograph4)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet17)
	(supports instrument11 infrared3)
	(supports instrument11 spectrograph4)
	(calibration_target instrument11 Star12)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star12)
)
(:goal (and
	(pointing satellite1 Star8)
	(pointing satellite2 Star15)
	(pointing satellite4 GroundStation10)
	(have_image Star15 image1)
	(have_image Phenomenon16 image2)
	(have_image Planet17 spectrograph4)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
	(have_image Phenomenon20 thermograph0)
	(have_image Phenomenon21 thermograph0)
))

)

; plan
1. (turn_to satellite2 star15 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 star15)
   goals met: 1 of 10
2. (turn_to satellite1 groundstation10 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 groundstation10)
   goals met: 1 of 10
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 10
4. (calibrate satellite1 instrument4 groundstation10)
   added: (calibrated instrument4)
   goals met: 1 of 10
5. (turn_to satellite1 phenomenon21 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon21)
   goals met: 1 of 10
6. (take_image satellite1 phenomenon21 instrument4 thermograph0)
   added: (have_image phenomenon21 thermograph0)
   goals met: 2 of 10
7. (turn_to satellite1 phenomenon20 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 phenomenon20)
   goals met: 2 of 10
8. (take_image satellite1 phenomenon20 instrument4 thermograph0)
   added: (have_image phenomenon20 thermograph0)
   goals met: 3 of 10
9. (turn_to satellite1 phenomenon16 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 phenomenon16)
   goals met: 3 of 10
10. (take_image satellite1 phenomenon16 instrument4 image2)
   added: (have_image phenomenon16 image2)
   goals met: 4 of 10
11. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 4 of 10
12. (calibrate satellite4 instrument11 star12)
   added: (calibrated instrument11)
   goals met: 4 of 10
13. (turn_to satellite1 star15 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 star15)
   goals met: 4 of 10
14. (take_image satellite1 star15 instrument4 image1)
   added: (have_image star15 image1)
   goals met: 5 of 10
15. (turn_to satellite1 star18 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star18)
   goals met: 5 of 10
16. (take_image satellite1 star18 instrument4 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 6 of 10
17. (turn_to satellite1 star19 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star19)
   goals met: 6 of 10
18. (take_image satellite1 star19 instrument4 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 7 of 10
19. (turn_to satellite1 star8 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 star8)
   goals met: 8 of 10
20. (turn_to satellite4 planet17 star12)
   deleted: (pointing satellite4 star12)
   added: (pointing satellite4 planet17)
   goals met: 8 of 10
21. (take_image satellite4 planet17 instrument11 spectrograph4)
   added: (have_image planet17 spectrograph4)
   goals met: 9 of 10
22. (turn_to satellite4 groundstation10 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 groundstation10)
   goals met: 10 of 10
